# Parameter Type Id Classification Code Property

Source: https://www.revitapidocs.com/2026/d392831a-e310-74ce-04ba-60e41c29e34a.htm

---

| Parameter Type Id Classification Code Property |
| --- |

"Classification Number"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ClassificationCode { get; }
```

```
Public Shared ReadOnly Property ClassificationCode As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ClassificationCode {
	ForgeTypeId^ get ();
}
```

```
static member ClassificationCode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace